["COVID-19 Health & Support Megathread #9 - REMINDER: Follow local health orders and guidelines - stay safe - get vaccinated", "Federal government to require vaccinations for all federal public servants, air and train passengers | CBC News", "Ivison: Trudeau's about to call an election with no purpose — other than to gain more power", "I'm not an anti-vaxxer, I'm just refusing to get a life-saving vaccine during a global pandemic", "We are not anti-vaxxers': Concerns over side-effects, research among main reasons some Canadians are not getting COVID-19 vaccine", "Real estate: low-income condos bought by doctors and investors", "Halifax man devastated after insurer reverses decision to cover $25K cystic fibrosis drug", "Fired bureaucrat was ‘ringleader’ of group that took millions in government money, court hears", "Toronto tops the world house price index", "Ontario Big City Mayors Urge Justin Trudeau to Overturn CRTC Internet Ruling", "Alberta rejects idea of federal vaccine passport being used as proof of COVID-19 vaccination | Globalnews.ca", "Unvaccinated British Columbians may be denied entry to concerts, sporting events", "New polling shows Canadian voters are very concerned about the impact of industrial farming", "Federal, provincial governments announce $10 a day child-care agreement in Sask.", "Alberta backs down on relaxed COVID-19 measures, pauses testing changes for 6 weeks", "Singh says taxing the rich will be among top NDP policy goals for the federal election | CBC News", "Canada's EV Rebate Program Surpasses 100,000 Cars Purchased", "Erin O’Toole seeks intervenor status in Winnipeg virus lab case", "Health minister says 50 surgeries cancelled at Kelowna General Hospital due to COVID", "Multiple attempts to get faked COVID-19 vaccine proof in Quebec: sources", "First live ‘murder hornet’ sighted near U.S.-Canada border, say scientists", "Lethbridge Police charge 10 males in human trafficking investigation", "NDP Leader Jagmeet Singh announces he's going to be a dad", "China sees judicial system in political terms", "COVID-19 has led young Canadians to reassess their home ownership strategies", "Judge in Meng Wanzhou extradition hearing suggests American fraud charge is unusual - The Globe and Mail", "Former federal defence minister Paul Hellyer dies at 98", "GOLDSTEIN: We pay more in taxes than food, clothing, housing combined", "Atlantic Canada's offshore wind energy sector gets boost from new Ocean Supercluster project", "Quebec reports more than 400 new COVID-19 cases for 1st time since May", "Feds win battle for privacy of killers Paul Bernardo and Craig Munro; victims' families' required to pay $19,000", "Kelly McParland: Expected snap election shows Justin Trudeau stuffed up with his own importance", "Bell, Rogers and More Awarded $30 Million in Damages by Set-Top Box Retailers: Court", "Out of control: A growing area of high-hazard clearcuts and plantations are fuelling BC's raging forest infernos", "Canadian special forces ready to evacuate embassy after Kandahar falls to the Taliban", "BNN: First new oil sands pipeline in years could start next month", "Why Justin Trudeau’s expected election call could backfire", "Prime Minister Justin Trudeau is planning to call a snap election for Sept 20", "Canada has big decisions to make on China", "Old-growth protesters allege RCMP’s Fairy Creek actions defy recent court order", "Official: Canada sending forces to close Afghan embassy", "Sherway Gardens Mall in lockdown after shooting incident: police", "Independent modelling suggests imminent spike in Alberta COVID-19 cases, hospitalizations", "Province will backtrack on plans to lift COVID-19 protocols, government source says", "Let me breathe: Manitoba RCMP officer dismissed pleas while pinning man's neck in arrest, video shows", "Gatineau man arrested for alleged threats against Quebec health minister", "Vance told woman behind sexual misconduct allegation to be ‘clear on our story’ in calls - National | Globalnews.ca", "Alberta reconsiders removal of trace, test, isolation measures: sources", "‘Stay open’: Businesses urge provinces against lockdowns amid 4th wave of COVID-19", "Canadian justice lawyer says Huawei CFO was dishonest", "NDP promises universal pharmacare, mental health supports in first mandate, if elected", "B.C. orders mandatory COVID-19 vaccination for workers in assisted living and long-term care", "Stratford, Ontario", "Inexpensive anti-depressant could be best COVID treatment yet, Canadian-led trial finds", "Canada donating 10M J&J COVID vaccines to countries in need", "Health Canada says Cord Blood Bank of Canada removed all samples from storage before surprise inspection", "Queen's University mandates COVID-19 vaccinations for students, staff, and faculty", "Conservatives bar Yukon's Jonas Smith, citing opposition to 'public health guidelines'", "China Slams ‘Arrogant’ Trudeau as Huawei Battle Heats Up", "Alberta dangles KXL as Biden Pleads with OPEC to pump oil", "Britain's Olympic relay silver medallist suspended after positive test, Canada earned bronze in the event", "Single-game sports betting allowed in Canada as of Aug. 27", "If Erin O’Toole were prime minister, what would Canada look like? This week, he gave us some hints", "Edmonton defence lawyer cited for contempt after refusing to wear mask in court", "Got my parents' old slides digitized. Maybe someone you will get a kick out of it. Canadian old school cool.", "Ontario pastor fired after coming out as trans files lawsuit against Baptist church", "'We're in disaster mode': N.S. senior taken to hospital by police due to ambulance delay", "Canada Investing $1.44 Billion in Telesat for High-Speed Satellite Internet", "'Strong resurgence trajectory': Tam says Canada has entered fourth wave of COVID-19 pandemic", "NDP pledges free mental health care, better pandemic preparedness in new pre-election pitches", "Much closer to legal sports betting in Canada. Individual provinces will regulate and companies are finalizing plans. Good for us and probably a nice tax revenue", "Quebec to bar unvaccinated people from non-essential public places", "Original Niagara: Hidden Gems for the Cultured Traveller", "Social isolation can lead to late-stage prostate cancer diagnosis: Quebec study", "Admiral Art McDonald on leave, won't return as military chief while government 'reviews' his case: Sajjan", "Justin Trudeau Dresses Up As A Saudi Sheik So Biden Will Approve His Pipeline (Satire)", "Cineplex faces another quarterly loss as movie theatres slowly reopened across Canada", "Good news: Some climate change impacts are 'reversible.' Here's what that means | CBC News", "B.C. to hold press conference Thursday about mandatory vaccines for health-care workers", "Manitoba medical student expelled over 'pro-gun and pro-life' Facebook posts wins court ruling", "Conservatives unveil innovation policy ahead of potential election call, marking departure from Liberals", "Canada wants the U.S. to negotiate for its hostages", "John Ivison: Trudeau's desire for a majority is on a collision course with voter antipathy", "Inspiring! Man's Bad Reading Caused Anti-Lockdown Crowd to Tear Itself Apart", "It's not just home ownership – why cottages are increasingly out of reach for most Canadians", "Court martial for N.B. soldier accused of serving cannabis-laced cupcakes can proceed", "Typical 'vaccine hesitant' person is a 42-year-old Ontario woman who votes Liberal: Abacus polling", "Ontario reports 513 new COVID-19 cases as vaccines administered top 20M, 113 people treated for COVID-related illnesses in intensive care| CBC News", "RCMP, IIU investigate after Manitoba officer accused of kneeling on man’s neck", "Alberta says U.S. oil request ‘smacks of hypocrisy’ after it cancelled Keystone XL", "Defence minister pushes back on Admiral McDonald's plans to return as defence chief", "Federal Court decision against illicit set-top box providers lauded by Bell", "N.L. return-to-school plan aims for normal classroom experience", "Angus Reid Federal Poll: LPC 36, CPC 31, NDP 19, Bloc 7, Other 5, Green 3", "Winnipeg Jets games to go ahead at full capacity, attendees must be fully vaccinated", "Judge in Meng Wanzhou’s extradition case says U.S. allegation is unclear", "At East York murder trial, defence argues it’s not sex assault if the victim is dead", "Canada’s borders are now open to fully-vaccinated U.S. travellers. But is it the right time?", "To reduce the deficit, Canadians want increased taxes on the wealthy and large corporations", "NDP’s Singh announces plans to invest in building 500K homes in Canada, tax for foreign buyers"]